OpenNuvoton/M55M1BSP/SampleCode/StdDriver/FMC_MultiBoot/LDROM_system_M55M1.c
    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_PDMA1_Msk)
        NVIC_ITNS_CONF(PDMA1_IRQn);

    /* SCU_D1PNS0 */
    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_USBH0_Msk)
        NVIC_ITNS_CONF(USBH0_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_HSUSBH_Msk)
        NVIC_ITNS_CONF(HSUSBH_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_HSUSBD_Msk)
        NVIC_ITNS_CONF(HSUSBD_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_SDH0_Msk)
        NVIC_ITNS_CONF(SDH0_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_SDH1_Msk)
        NVIC_ITNS_CONF(SDH1_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_EMAC0_Msk)
        NVIC_ITNS_CONF(EMAC0_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_CRYPTO_Msk)
        NVIC_ITNS_CONF(CRYPTO_IRQn);

    if (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_CRC_Msk)
        NVIC_ITNS_CONF(CRC_IRQn);

    /* SCU_D1PNS1 */
    if (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_CANFD0_Msk)
    {
        NVIC_ITNS_CONF(CANFD00_IRQn);
        NVIC_ITNS_CONF(CANFD01_IRQn);
    }

    if (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_CANFD1_Msk)
    {
        NVIC_ITNS_CONF(CANFD10_IRQn);
        NVIC_ITNS_CONF(CANFD11_IRQn);
    }

    /* SCU_D1PNS2 */
    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_WWDT0_Msk)
        NVIC_ITNS_CONF(WWDT0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EADC0_Msk)
    {
        NVIC_ITNS_CONF(EADC00_IRQn);
        NVIC_ITNS_CONF(EADC01_IRQn);
        NVIC_ITNS_CONF(EADC02_IRQn);
        NVIC_ITNS_CONF(EADC03_IRQn);
    }

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EPWM0_Msk)
    {
        NVIC_ITNS_CONF(BRAKE0_IRQn);
        NVIC_ITNS_CONF(EPWM0P0_IRQn);
        NVIC_ITNS_CONF(EPWM0P1_IRQn);
        NVIC_ITNS_CONF(EPWM0P2_IRQn);
    }

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_BPWM0_Msk)
        NVIC_ITNS_CONF(BPWM0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EQEI0_Msk)
        NVIC_ITNS_CONF(EQEI0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EQEI2_Msk)
        NVIC_ITNS_CONF(EQEI2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ECAP0_Msk)
        NVIC_ITNS_CONF(ECAP0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ECAP2_Msk)
        NVIC_ITNS_CONF(ECAP2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2C0_Msk)
        NVIC_ITNS_CONF(I2C0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2C2_Msk)
        NVIC_ITNS_CONF(I2C2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_QSPI0_Msk)
        NVIC_ITNS_CONF(QSPI0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SPI0_Msk)
        NVIC_ITNS_CONF(SPI0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SPI2_Msk)
        NVIC_ITNS_CONF(SPI2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART0_Msk)
        NVIC_ITNS_CONF(UART0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART2_Msk)
        NVIC_ITNS_CONF(UART2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART4_Msk)
        NVIC_ITNS_CONF(UART4_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART6_Msk)
        NVIC_ITNS_CONF(UART6_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART8_Msk)
        NVIC_ITNS_CONF(UART8_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_USCI0_Msk)
        NVIC_ITNS_CONF(USCI0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SC0_Msk)
        NVIC_ITNS_CONF(SC0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SC2_Msk)
        NVIC_ITNS_CONF(SC2_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_PSIO_Msk)
        NVIC_ITNS_CONF(PSIO_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_TMR01_Msk)
    {
        NVIC_ITNS_CONF(TIMER0_IRQn);
        NVIC_ITNS_CONF(TIMER1_IRQn);
    }

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_DAC01_Msk)
        NVIC_ITNS_CONF(DAC01_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_HSOTG_Msk)
        NVIC_ITNS_CONF(HSOTG_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2S0_Msk)
        NVIC_ITNS_CONF(I2S0_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ACMP01_Msk)
        NVIC_ITNS_CONF(ACMP01_IRQn);

    if (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_USBD_Msk)
        NVIC_ITNS_CONF(USBD_IRQn);

    /* SCU_D1PNS4 */
    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_WWDT1_Msk)
        NVIC_ITNS_CONF(WWDT1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EPWM1_Msk)
    {
        NVIC_ITNS_CONF(BRAKE1_IRQn);
        NVIC_ITNS_CONF(EPWM1P0_IRQn);
        NVIC_ITNS_CONF(EPWM1P1_IRQn);
        NVIC_ITNS_CONF(EPWM1P2_IRQn);
    }

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_BPWM1_Msk)
        NVIC_ITNS_CONF(BPWM1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EQEI1_Msk)
        NVIC_ITNS_CONF(EQEI1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EQEI3_Msk)
        NVIC_ITNS_CONF(EQEI3_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ECAP1_Msk)
        NVIC_ITNS_CONF(ECAP1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ECAP3_Msk)
        NVIC_ITNS_CONF(ECAP3_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2C1_Msk)
        NVIC_ITNS_CONF(I2C1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2C3_Msk)
        NVIC_ITNS_CONF(I2C3_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_QSPI1_Msk)
        NVIC_ITNS_CONF(QSPI1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SPI1_Msk)
        NVIC_ITNS_CONF(SPI1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SPI3_Msk)
        NVIC_ITNS_CONF(SPI3_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART1_Msk)
        NVIC_ITNS_CONF(UART1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART3_Msk)
        NVIC_ITNS_CONF(UART3_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART5_Msk)
        NVIC_ITNS_CONF(UART5_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART7_Msk)
        NVIC_ITNS_CONF(UART7_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART9_Msk)
        NVIC_ITNS_CONF(UART9_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SC1_Msk)
        NVIC_ITNS_CONF(SC1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_OTG_Msk)
        NVIC_ITNS_CONF(USBOTG_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_KPI_Msk)
        NVIC_ITNS_CONF(KPI_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_TMR23_Msk)
    {
        NVIC_ITNS_CONF(TIMER2_IRQn);
        NVIC_ITNS_CONF(TIMER3_IRQn);
    }

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_TRNG_Msk)
        NVIC_ITNS_CONF(TRNG_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_RTC_Msk)
        NVIC_ITNS_CONF(RTC_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2S1_Msk)
        NVIC_ITNS_CONF(I2S1_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ACMP23_Msk)
        NVIC_ITNS_CONF(ACMP23_IRQn);

